Repository: MetaModels/attribute_alias
Catalog: src/Resources/translations/*_metamodel_attribute.*.xlf
Languages: de, fr, it

# display_legend
source: Display settings
de: Anzeigeeinstellungen
fr: Afficher les réglages
it: Impostazioni di visualizzazione

# slugLocale.label
source: Convert language
de: Konvertierungssprache
fr: Convertir la langue
it: Traduci in lingua

# slugLocale.description
source: Please enter the language to convert alias characters according to the ISO-639-1 standard (e.g. "en" for English or "en-US" for American English).
de: Bitte geben Sie die Sprache an, in die die Alias-Zeichen nach dem ISO-639-1-Standard umgewandelt werden sollen (z. B. "en" für Englisch oder "en-US" für amerikanisches Englisch).
fr: Veuillez indiquer la langue pour convertir les caractères d'alias conformément au standard ISO-639-1 (ex: "en" pour English ou "en-US" pour American English).
it: Inserisci la lingua in cui convertire i caratteri alias secondo lo standard ISO-639-1 (ad esempio "en" per l'inglese o "en-US" per l'inglese americano).

# noIntegerPrefix.label
source: No integer prefix
de: Kein Integer-Präfix
fr: Pas d'integer dans le préfixe.
it: Non utilizzare numeri come prefisso

# noIntegerPrefix.description
source: Do not set an "id-" prefix if the resulting alias is numeric.
de: Setzt kein "id-"-Präfix, wenn der resultierende Alias numerisch ist.
fr: Ne pas définir un préfixe avec "ID-" si l'alias est numérique
it: Non impostare il prefisso "id-" se l'alias risultante è numerico.

# alias_prefix.label
source: Alias prefix
de: Alias-Präfix
fr: Préfixe d'alias
it: Prefisso alias

# alias_prefix.description
source: Optionally add a prefix term.
de: Optionale Angabe eines Präfix für die Erstellung des Alias.
fr: Ajouter un préfixe optionnel
it: In modo facoltativo, indica un termine prefisso da aggiungere.

# alias_postfix.label
source: Alias postfix
fr: Postfixe d'alias
it: Postfisso alias

# alias_postfix.description
source: Optionally add a postfix term.
de: Optionale Angabe eines Postfix für die Erstellung des Alias.
fr: Ajouter un terme postfixe optionnel
it: In modo facoltativo, indica un termine postfisso da aggiungere.

# alias_fields.label
source: Alias fields
de: Alias-Felder
fr: Champs d'alias
it: Campi alias

# alias_fields.description
source: Please select one or more attributes to combine a alias.
de: Bitte wählen Sie eines oder mehrere Attribute, um daraus einen Alias zu bilden.
fr: Choisissez le ou les attributs à combiner pour former l'alias
it: Seleziona uno o più attributi per creare un alias.

# force_alias.label
source: Force alias regenerating
de: Neuerstellung des Alias erzwingen
fr: Forcer la régénration de l'alias
it: Forza la rigenerazione dell'alias

# force_alias.description
source: Check this, if you want the alias to be regenerated whenever any of the dependant fields is changed. Note that this will invalidate old urls that are based upon the alias.
de: Auswählen, um eine Neuerstellung des Alias zu erzwingen, wenn sich eines der abhängigen Felder ändert. Beachten Sie, dass bisherige URLs dadurch ungültig werden können.
fr: Cocher cette case pour que l'alias soit recréé à chaque fois que le contenu d'un des champs qui le composent est modifié. Ça peut rendre invalides les anciennes urls qui sont basées sur l'alias.
it: Seleziona questa opzione se vuoi che l'alias venga rigenerato ogni volta che uno qualsiasi dei campi dipendenti viene modificato. Nota che questo invaliderà i vecchi URL basati sull'alias.

# validAliasCharacters.label
source: Valid alias characters
de: Gültige Alias-Zeichen
fr: Caractères autorisés pour l'alias
it: Caratteri validi per l'alias

# validAliasCharacters.description
source: Here you can select a custom character set for auto-generated aliases.
de: Hier können Sie einen benutzerdefinierten Zeichensatz für automatisch generierte Aliase auswählen.
fr: Vous pouvez sélectionner le jeu de caractères autorisés pour es alias auto-générés.
it: Qui puoi selezionare un set di caratteri personalizzato per gli alias generati automaticamente.

# select_values.meta
source: Metafields
de: Metafelder
fr: Champs meta
it: Metacampi

# select_values.attributes
source: Attributes
de: Attribute
fr: Attributs
it: Attributi

# field_attribute.label
source: Attributes
de: Attribute
fr: Attributs
it: Attributi

# select_values.sorting
source: Sorting
de: Sortierung
fr: Tri
it: Ordinamento

# validAliasCharacters_headline
source: Supported character sets that can be used when generating alias values.
it: Set di caratteri supportati che possono essere utilizzati durante la generazione di valori alias.

# validAliasCharacters_unicode_nsl.caption
source: Unicode numbers and small letters
it: Numeri unicode e lettere minuscole

# validAliasCharacters_unicode_nsl.description
source: From the page name "Über uns" the alias "über-uns" is generated.
it: Per una pagina denominata "Informazioni sulla città" viene generato l'alias "informazioni-sulla-città".

# validAliasCharacters_unicode_nl.caption
source: Unicode numbers and letters
it: Numeri e lettere unicode

# validAliasCharacters_unicode_nl.description
source: From the page name "Über uns" the alias "Über-uns" is generated.
it: Per una pagina denominata "Informazioni sulla città" viene generato l'alias "Informazioni-sulla-città".

# validAliasCharacters_ascii_nsl.caption
source: ASCII numbers and small letters
it: Numeri ASCII e lettere minuscole

# validAliasCharacters_ascii_nsl.description
source: From the page name "Über uns" the alias "ueber-uns" is generated.
it: Per una pagina denominata "Informazioni sulla città" viene generato l'alias "informazioni-sulla-citta".

# validAliasCharacters_ascii_nl.caption
source: ASCII numbers and letters
it: Numeri e lettere ASCII

# validAliasCharacters_ascii_nl.description
source: From the page name "Über uns" the alias "Ueber-uns" is generated.
it: Per una pagina denominata "Informazioni sulla città" viene generato l'alias "Informazioni-sulla-citta".

# select_values.tstamp
source: Timestamp
de: Zeitstempel

# select_values.vargroup
source: Vargroup
de: Variantengruppe

# select_values.varbase
source: Varbase
de: Variantenbasis
